l = [  10,  20,  30,  40,  50]
#     0    1    2    3    4


# for element in l:
#     print(element)


l2 = l[ 0:2 ]      # 10,20
l3 = l[ 2:4 ]      # 30,40

l4 = l[ 1: ]      # 20,30,40,50
l5 = l[ :3 ]      # 10,20,30
l6 = l[ : ]      # 10,20,30,40,50


l7 = l[  : :2 ]   # 10, 30, 50
l8 = l[ 1: :2 ]   # 20,40

l8 = l[ 1:4 :1 ]   # 20,30,40
print(l[ 1:4 :-1 ])     # []
print(l[ : :-1 ])

l = [  10,  20,  30,  40,  50]
#     0    1    2    3    4

l = l + [90]
l = l + [95, 96]
l = [1] + l
#l = 2 + l       # ошибка


l.append( 999 )

print(l)
print( len( l ) )


# см. модуль deepcopy
l1 = [1,2,3,4,5]
l3 = l1[::]
l2 = l1
l2[0] = 10

print(l1)
print(l3)

l4 = l3.copy()


import numpy

matr = [ [1,2,3],
         [4,5,6],
         [7,8,9] ]

matr[1][1]  # 5
matr[1]  # [4,5,6]

len( matr )  # 3
